bao1311/stm32f4xx_drivers/Src/011i2c_master_rx_testing.c
/*
 * 011i2c_master_rx_testing.c
 *
 *  Created on: Sep 6, 2025
 *      Author: gphi1
 */

#include "stm32f407xx_i2c_driver.h"
#include "stm32f407xx.h"
#include "string.h"
#include "stm32f407xx_gpio_driver.h"

#define CMD_READ_LEN_DATA 		0x51
#define CMD_READ_CMPLT_DATA 	0x52


I2C_Handle_t pI2CHandle;
GPIO_Handle_t GPIOHandle;
void GPIOInit()
{
	// SCL -> PB6
	// SDA -> PB7
	GPIOHandle.GPIO_PinConfig.GPIO_PinAltFunMode = 4;
	GPIOHandle.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	GPIOHandle.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	GPIOHandle.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	GPIOHandle.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

	// Configure pin for SCL => PB6
	GPIOHandle.GPIO_PinConfig.GPIO_PinNumber = 6;
	GPIO_Init(&GPIOHandle);

	// Configure pin for SDA => PB7
	GPIOHandle.GPIO_PinConfig.GPIO_PinNumber = 7;
	GPIO_Init(&GPIOHandle);

}


int main()
{
	// GPIO Init for SCL, SDA line
	// SCL->PB6
	// SDA->PB7
	GPIOInit();


	// Enable I2C Peripheral
	I2C_PeriClockControl(I2C1, ENABLE);

	// Master send command code 0x51 to read length data from Slave
	I2C_MasterSendData(pHandle, pTxBuffer, Len, SlaveAddr);

	// Close Send Data
	I2C_CloseSendData(pI2CHandle);

	// Master receive length data from slave
	I2C_MasterReceiveData(pHandle, pRxBuffer, Len, SlaveAddr);

	// Master read complete data from slave
	I2C_MasterReceiveData(pHandle, pRxBuffer, Len, SlaveAddr);

	// Close Receive Data
	I2C_CloseReceiveData(pI2CHandle);

}


